# SpotSlopeSuffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotSlopeSuffix Property
ParameterTypeId Class See Also
---
"Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotSlopeSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotSlopeSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotSlopeSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace